app/Controllers/Home.php

SELECT *
FROM `products`
WHERE `is_available` = 1
ORDER BY `current_discount` DESC
 LIMIT 1
SELECT *
FROM `settings`
---
    public function index()
    {
        $best_deal = $this->ProductModel->where(['is_available' => 1])->orderBy('current_discount', 'DESC')->first();
        $setting = $this->SettingModel->findAll();