app/Controllers/Product.php

    public function index()
    {

        $data = [
            'store_name' => 'Juragan Sepatu',
            'title' => 'Product',
            'products' => $this->ProductModel->paginate(8, 'card'),
            'pager' => $this->ProductModel->pager,
            'cart' => \Config\Services::cart()
        ];
---
SELECT *
FROM `products`
 LIMIT 8
SELECT COUNT(*) AS `numrows`
FROM `products`